In [214]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hayan2\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\hayan2\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hayan2\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\hayan2\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\hayan2\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [215]:
import pandas as pd

In [216]:
stock = pd.DataFrame({'date' : ['1996', '1976', '2010', '2020'],
                       'symbol' : [1111, 2222, 3333, 4444],
                       'market' : ['KOSPI', 'KOSPI', 'KOSDAQ', 'KOSDAQ']
                      }, index = ['삼성전자', '현대차', 'NAVER', '하이브'])
stock

       date  symbol  market
삼성전자   1996    1111   KOSPI
현대차    1976    2222   KOSPI
NAVER  2010    3333  KOSDAQ
하이브    2020    4444  KOSDAQ

In [217]:
stock['date']

삼성전자     1996
현대차      1976
NAVER    2010
하이브      2020
Name: date, dtype: object

In [218]:
stock.date

삼성전자     1996
현대차      1976
NAVER    2010
하이브      2020
Name: date, dtype: object

In [219]:
stock[['symbol', 'market']]

       symbol  market
삼성전자     1111   KOSPI
현대차      2222   KOSPI
NAVER    3333  KOSDAQ
하이브      4444  KOSDAQ

In [220]:
stock[['market']]

       market
삼성전자    KOSPI
현대차     KOSPI
NAVER  KOSDAQ
하이브    KOSDAQ

> ## 연습 2-9

In [221]:
data = pd.DataFrame({'지역명' : ['서울', '서울', '부산', '광주'],
                       '연도' : [2021, 2020, 2020, 2019],
                       '규모구분' : [84, 84, 102, 102],
                       '분양가격' : [5000, 4000, 6000, 4000]
                      })

data['연도']

0    2021
1    2020
2    2020
3    2019
Name: 연도, dtype: int64

> ## 연습 2-10

In [222]:
data[['지역명', '분양가격']]

  지역명  분양가격
0  서울  5000
1  서울  4000
2  부산  6000
3  광주  4000

In [223]:
stock.columns

Index(['date', 'symbol', 'market'], dtype='object')

In [224]:
stock.columns[0]

'date'

In [225]:
stock.columns[2]

'market'

In [226]:
stock[stock.columns[2]]

삼성전자      KOSPI
현대차       KOSPI
NAVER    KOSDAQ
하이브      KOSDAQ
Name: market, dtype: object

In [227]:
stock[stock.columns[-1]]

삼성전자      KOSPI
현대차       KOSPI
NAVER    KOSDAQ
하이브      KOSDAQ
Name: market, dtype: object

> ## 연습 2-10-1

In [228]:
data[data.columns[3]]

0    5000
1    4000
2    6000
3    4000
Name: 분양가격, dtype: int64

> ## 연습 2-10-2

In [229]:
data[[data.columns[1], data.columns[2]]]

     연도  규모구분
0  2021    84
1  2020    84
2  2020   102
3  2019   102

In [230]:
stock['date']

삼성전자     1996
현대차      1976
NAVER    2010
하이브      2020
Name: date, dtype: object

In [231]:
stock['date'][1:3]

현대차      1976
NAVER    2010
Name: date, dtype: object

In [232]:
stock[['date', 'market']][2:]

       date  market
NAVER  2010  KOSDAQ
하이브    2020  KOSDAQ

> ## 연습 2-10-3

In [233]:
data[['연도', '규모구분']][:2]

     연도  규모구분
0  2021    84
1  2020    84

In [234]:
stock.loc['현대차']

date       1976
symbol     2222
market    KOSPI
Name: 현대차, dtype: object

In [235]:
new_stock = stock.loc['현대차']
list(new_stock)

['1976', 2222, 'KOSPI']

In [236]:
dict(new_stock)

{'date': '1976', 'symbol': 2222, 'market': 'KOSPI'}

In [237]:
stock.loc[['하이브', 'NAVER']]

       date  symbol  market
하이브    2020    4444  KOSDAQ
NAVER  2010    3333  KOSDAQ

In [238]:
stock.iloc[2]

date        2010
symbol      3333
market    KOSDAQ
Name: NAVER, dtype: object

In [239]:
stock.iloc[[1, 2]]

       date  symbol  market
현대차    1976    2222   KOSPI
NAVER  2010    3333  KOSDAQ

In [240]:
stock.iloc[1:3]

       date  symbol  market
현대차    1976    2222   KOSPI
NAVER  2010    3333  KOSDAQ

> ## 연습 2-11

In [255]:
data.rename(index = {0 : 'a', 1 : 'b', 2 : 'c', 3 : 'd'}, inplace = True)
print(data.loc['c'])
data.iloc[0]

지역명       부산
연도      2020
규모구분     102
분양가격    6000
Name: c, dtype: object

지역명       서울
연도      2021
규모구분      84
분양가격    5000
Name: a, dtype: object

> ## 연습 2-12

In [257]:
data.loc[['b', 'c', 'd']]

  지역명    연도  규모구분  분양가격
b  서울  2020    84  4000
c  부산  2020   102  6000
d  광주  2019   102  4000

In [258]:
data.iloc[[1, 2, 3]]

  지역명    연도  규모구분  분양가격
b  서울  2020    84  4000
c  부산  2020   102  6000
d  광주  2019   102  4000

In [260]:
company = pd.DataFrame([['인사팀', '2020.9'],
                       ['인사팀', '2015.3'],
                       ['관리팀', '2010.5'],
                       ['영업팀', '2020.5'],
                       ['관리팀', '2015.8'],
                       ['기획팀', '2010.5']
                       ], columns = ['부서', '입사일'],
                      index = ['김철수', '이영희', '장보고', '이순신', '홍길동', '김기준'])
company[::2]

      부서     입사일
김철수  인사팀  2020.9
장보고  관리팀  2010.5
홍길동  관리팀  2015.8

In [261]:
company[0:4:2]

      부서     입사일
김철수  인사팀  2020.9
장보고  관리팀  2010.5

In [262]:
company[::-1]

      부서     입사일
김기준  기획팀  2010.5
홍길동  관리팀  2015.8
이순신  영업팀  2020.5
장보고  관리팀  2010.5
이영희  인사팀  2015.3
김철수  인사팀  2020.9

> ## 연습 2-13

In [266]:
company[1:(len(company.index)):2]

      부서     입사일
이영희  인사팀  2015.3
이순신  영업팀  2020.5
김기준  기획팀  2010.5

In [268]:
company.loc['홍길동', '부서']

'관리팀'

In [269]:
company.iloc[4, 0]

'관리팀'

In [270]:
company.loc['이영희', ['부서', '입사일']]

부서        인사팀
입사일    2015.3
Name: 이영희, dtype: object

In [271]:
company.iloc[1, [0, 1]]

부서        인사팀
입사일    2015.3
Name: 이영희, dtype: object

In [272]:
company.loc['이영희', '부서' : '입사일']

부서        인사팀
입사일    2015.3
Name: 이영희, dtype: object

In [273]:
company.iloc[1, 0:]

부서        인사팀
입사일    2015.3
Name: 이영희, dtype: object

> ## 연습 2-14

In [276]:
data.loc['c', '지역명']

'부산'

In [278]:
data.loc['d', ['지역명', '연도']]

지역명      광주
연도     2019
Name: d, dtype: object

In [283]:
company

      부서     입사일
김철수  인사팀  2020.9
이영희  인사팀  2015.3
장보고  관리팀  2010.5
이순신  영업팀  2020.5
홍길동  관리팀  2015.8
김기준  기획팀  2010.5

In [279]:
company.loc[['김철수', '이영희'], ['부서', '입사일']]

      부서     입사일
김철수  인사팀  2020.9
이영희  인사팀  2015.3

In [280]:
company.loc['김철수' : '이영희', '부서' : '입사일']

      부서     입사일
김철수  인사팀  2020.9
이영희  인사팀  2015.3

In [281]:
company.iloc[[0, 1], [0, 1]]

      부서     입사일
김철수  인사팀  2020.9
이영희  인사팀  2015.3

In [282]:
company.iloc[0:2, 0:]

      부서     입사일
김철수  인사팀  2020.9
이영희  인사팀  2015.3

> ## 연습 2-15

In [290]:
dict_data = {'입고량' : [15, 25, 35, 45, 65],
            '판매량' : [5, 0, 7, 10, 50],
            '재고량' : [10, 25, 28, 35, 15]}
branch = ['대구', '서울', '부산', '대전', '인천']

store = pd.DataFrame(dict_data, index = branch)

store.iloc[[1, 0, 2], [0, 2]]

    입고량  재고량
서울   25   25
대구   15   10
부산   35   28

> ## 연습 2-15-1

In [291]:
school

NameError: name 'school' is not defined

In [292]:
data = {
    '이름' : ['표치수', '김대만', '송태섭', '서태웅', '강백호', '변덕규', '황태산', '윤대협'],
    '학교' : ['호산고', '호산고', '호산고', '호산고', '호산고', '성서고', '성서고', '성서고'],
    '키' : [197, 184, 168, 187, 188, 202, 188, 190],
    '국어' : [90, 40, 80, 40, 15, 80, 55, 100],
    '영어' : [85, 35, 75, 60, 20, 100, 65, 85],
    '수학' : [100, 50, 70, 70, 10, 95, 45, 90],
    '과학' : [95, 55, 80, 75, 35, 85, 40, 95],
    '사회' : [85, 25, 75, 80, 10, 80, 35, 95],
    'SW특기' : ['Python', 'Java', 'Javascript', '', '', 'C', 'PYTHON', 'C#']
}
dict_df = pd.DataFrame(data)

In [295]:
idx = ['1번','2번','3번','4번','5번','6번','7번','8번']
dict_df.index = idx
dict_df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
1번  표치수  호산고  197   90   85  100  95  85      Python
2번  김대만  호산고  184   40   35   50  55  25        Java
3번  송태섭  호산고  168   80   75   70  80  75  Javascript
4번  서태웅  호산고  187   40   60   70  75  80
5번  강백호  호산고  188   15   20   10  35  10
6번  변덕규  성서고  202   80  100   95  85  80           C
7번  황태산  성서고  188   55   65   45  40  35      PYTHON
8번  윤대협  성서고  190  100   85   90  95  95          C#

In [296]:
dict_df

     이름   학교    키   국어   영어   수학  과학  사회        SW특기
1번  표치수  호산고  197   90   85  100  95  85      Python
2번  김대만  호산고  184   40   35   50  55  25        Java
3번  송태섭  호산고  168   80   75   70  80  75  Javascript
4번  서태웅  호산고  187   40   60   70  75  80
5번  강백호  호산고  188   15   20   10  35  10
6번  변덕규  성서고  202   80  100   95  85  80           C
7번  황태산  성서고  188   55   65   45  40  35      PYTHON
8번  윤대협  성서고  190  100   85   90  95  95          C#

In [298]:
dict_df.iloc[0, 4]

85

In [300]:
dict_df.iloc[[0, 1], [3]]

    국어
1번  90
2번  40

In [301]:
dict_df.iloc[[0, 1], [3, 5]]

    국어   수학
1번  90  100
2번  40   50

In [303]:
dict_df.iloc[0:5, 3:8]

    국어  영어   수학  과학  사회
1번  90  85  100  95  85
2번  40  35   50  55  25
3번  80  75   70  80  75
4번  40  60   70  75  80
5번  15  20   10  35  10